#include <iostream>
#include <stdio.h>

#include <time.h>
using namespace std;

#define arraySize 10

void main()
{
	int mas[arraySize];
	srand(time(NULL));
	setlocale(LC_ALL, "Rus");
	/*2.	Çàïîëíèòü ìàññèâ èç äåñÿòè ýëåìåíòîâ
	çíà÷åíèÿìè, ââîäèìûìè ñ êëàâèàòóðû
	â õîäå âûïîëíåíèÿ ïðîãðàììû*/

	/*for (int i = 0; i < arraySize; i++)
	{
		cin >> mas[i];
	}*/
	int nz = 0;
	cin >> nz;
	if (nz == 1)
	{
		/*3.	Ìàññèâ ïðåäíàçíà÷åí äëÿ õðàíåíèÿ çíà÷åíèé
		ðîñòîâ äâåíàäöàòè ÷åëîâåê*/

		int mas2[12];

		/* Ñ ïîìîùüþ äàò÷èêà
		ñëó÷àéíûõ ÷èñåë çàïîëíèòü ìàññèâ öåëûìè çíà÷åíèÿìè*/
		int i = 0;
		for (i; i < 12; i++)
		{
			//ëåæàùèìè â äèàïàçîíå îò 163 äî 190 âêëþ÷èòåëüíî
			mas2[i] = 163 + rand() % 28;
			cout << " --> " << mas2[i] << endl;
		}
		
		/*
		4.	Ñîñòàâèòü ïðîãðàììó âûâîäà íà 
		ýêðàí ëþáîãî ýëåìåíòà ìàññèâà ïî åãî èíäåêñó
		*/
		
		cout << "Ââåäèòå èíäåêñ â äåàïîçîíå îò 0 - 12 : ";
		cin >> i;
		cout << mas2[i] << endl;


	}
	else if (nz == 2)
	{
		//Âûâåñòè ýëåìåíòû ìàññèâà íà ýêðàí â îáðàòíîì ïîðÿäêå
		int i = 0;
		int mas2[12];
		for (i; i < 12; i++)
		{
			//ëåæàùèìè â äèàïàçîíå îò 163 äî 190 âêëþ÷èòåëüíî
			mas2[i] = 163 + rand() % 28;
			cout << i <<" --> " << mas2[i] << endl;
		}
		cout << "Â îáðàòíîì ïîðÿäêå"<<endl;
		for (i=11; i >= 0; i--)
		{
			cout << i << " --> " << mas2[i] << endl;
		}

	}
}
